Revit 2026 API

# BuiltInFailuresSteelElementsFailures Class

---

Failures about SteelElement module

SystemObject Autodesk.Revit.DBBuiltInFailuresSteelElementsFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SteelElementsFailures
```
```vb
Public NotInheritable Class SteelElementsFailures
```
```cpp
public ref class SteelElementsFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SteelElementsFailures = class end
```

The BuiltInFailuresSteelElementsFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SteelElementInvisibleInCurrentLevelOfDetailWarn | The created elements are only visible in Detail Level: Fine. |
|  | SteelElementModifiersWillBeIgnoredWarn | The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry. |

#### Reference

Autodesk.Revit.DB Namespace